In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([2,4,6,8,np.nan,10,12,14,np.nan])
data

0     2.0
1     4.0
2     6.0
3     8.0
4     NaN
5    10.0
6    12.0
7    14.0
8     NaN
dtype: float64

In [5]:
data.notnull()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
8    False
dtype: bool

In [8]:
dict1 = {
    0:[2,6,8,10,np.nan],
    1:[12,14,16,np.nan,np.nan],
    2:[18,np.nan,np.nan,np.nan,np.nan],
    3:[np.nan,np.nan,np.nan,np.nan,np.nan],
    4:[20,np.nan,22,np.nan,24]
}

df = pd.DataFrame(dict1)
df

      0     1     2   3     4
0   2.0  12.0  18.0 NaN  20.0
1   6.0  14.0   NaN NaN   NaN
2   8.0  16.0   NaN NaN  22.0
3  10.0   NaN   NaN NaN   NaN
4   NaN   NaN   NaN NaN  24.0

In [10]:
df.dropna(axis=1, how='all')

      0     1     2     4
0   2.0  12.0  18.0  20.0
1   6.0  14.0   NaN   NaN
2   8.0  16.0   NaN  22.0
3  10.0   NaN   NaN   NaN
4   NaN   NaN   NaN  24.0

In [12]:
df_mean=df.fillna(df.mean())
df_mean

      0     1     2   3     4
0   2.0  12.0  18.0 NaN  20.0
1   6.0  14.0  18.0 NaN  22.0
2   8.0  16.0  18.0 NaN  22.0
3  10.0  14.0  18.0 NaN  22.0
4   6.5  14.0  18.0 NaN  24.0